下次再看的时候需要再细看的
P70
关于质量保证这个还要再看看第20章

P80
关于松散耦合这点
P88
图 5-6

P95
全局数据的弊端

P99
使用访问器主程序对状态变量的直接检查

P102
语义耦合的例子

P104
表 5-1 常见设计模式

P106
严格描述类契约

P107
有意识地选择绑定时间

P109
图 5-10 《怎样解题》总结

P110
解决设计难题的有效原则

P112 - P113
自上而下 这部分不太好理解

P118
使用 CRC
在适当的细节层创建 UML 图

P126
抽象数据类型（ADT, abstract data type）

P129
不要让 ADT 依赖于其存储介质

P133
使用隐含实例（需要倍加小心）

P136
第二段不太理解

P142
语义破坏封装性的例子、正确使用类的方法

P149
多重继承的用途主要是定义"混合体"

P149
Demeter 法则

P151
构造函数

P153
建立中心控制点

P155
把相关操作包装到一起
实现某种特定的重构

P165
支持子类化

P168
顺序的内聚性 这里举的 年龄和退休时间
通讯内聚性 然后在原本调用那个具有通信内聚性的子程序的更高层的子程序中调用这两个子程序（说得这么绕，理解得费劲）
临时内聚性
这一页讲内聚性的例子，讲得很绕，不好理解

P172
起名困难的时候，可以来看看这里的“对仗词”

P178
应该对哪些接口参数的假定进行说明呢？

P196
缓冲区溢出，不知道是什么

P198
还可以用异常来清理一段代码中存在的错误逻辑， 17.3 节中“用 try-finally 重写”一例所示。

P205
四重链表（quadruply linked list），不知道是什么

在调试模式下，Microsoft Word 在空闲循环中加入了一些代码，它们每隔几秒钟就检查一次 Document 对象的完整性。这样既有助于快速检测到数据的损坏，也方便了对错误的诊断。
不知道是什么
